## Pandas

In [ ]:
#raed_csv to read the file of this xtension
#read_excel to read the file of this xtn

In [17]:
#to get the contents from the file
import pandas as pd
data = pd.read_excel("C:\\Users\\Lap3\\Documents\\marks.xlsx")
data

     Names  Marks
0     mahi     55
1    rahul     80
2    buddy    100
3   sandy      90
4   jordan     78
5    pandy     74
6     urgu     98
7  neesham     82

In [44]:
#inserting the data 
import pandas as pd
data1 = pd.DataFrame({'Names':['Alex','Bob','Gary','blur','aliv','sam'],'Marks':[55,80,75,54,43,63]})
data1

  Names  Marks
0  Alex     55
1   Bob     80
2  Gary     75
3  blur     54
4  aliv     43
5   sam     63

In [20]:
#to see the attribute and column names
data1.columns
data1.index

RangeIndex(start=0, stop=3, step=1)

In [19]:
data.head(3)

   Names  Marks
0   mahi     55
1  rahul     80
2  buddy    100

In [22]:
data.tail(3)

     Names  Marks
5    pandy     74
6     urgu     98
7  neesham     82

In [24]:
# shape used to display the dimensions 
data.shape

(8, 2)

In [25]:
data.rename(columns={'Names':"namees"})

    namees  Marks
0     mahi     55
1    rahul     80
2    buddy    100
3   sandy      90
4   jordan     78
5    pandy     74
6     urgu     98
7  neesham     82

In [ ]:
data.rename()#shift+tab

## axis=0[rows]1[columns]

In [26]:
data1.drop('Marks',axis=1).head()

  Names
0  Alex
1   Bob
2  Gary

In [45]:
data1.drop([1], axis = 0).head()

  Names  Marks
0  Alex     55
2  Gary     75
3  blur     54
4  aliv     43
5   sam     63

In [46]:
data1.Names

0    Alex
1     Bob
2    Gary
3    blur
4    aliv
5     sam
Name: Names, dtype: object

In [50]:
data1['Names']

0    Alex
1     Bob
2    Gary
3    blur
4    aliv
5     sam
Name: Names, dtype: object

In [48]:
## loc-used for accessing with the labels
data1.loc[1]['Names']

'Bob'

In [49]:
data1.iloc[1][0]

'Bob'

In [51]:
data1.set_index('Names')

       Marks
Names
Alex      55
Bob       80
Gary      75
blur      54
aliv      43
sam       63

In [52]:
data.loc

In [61]:
data2=pd.DataFrame({'class':[1,2,3,4,5,6,8,9,7,8]})
data2

   class
0      1
1      2
2      3
3      4
4      5
5      6
6      8
7      9
8      7
9      8

In [57]:
pd.concat([data1,data2],axis=1)

  Names  Marks  class
0  Alex   55.0      1
1   Bob   80.0      2
2  Gary   75.0      3
3  blur   54.0      4
4  aliv   43.0      5
5   sam   63.0      6
6   NaN    NaN      8
7   NaN    NaN      9
8   NaN    NaN      7

In [58]:
type(data1)

pandas.core.frame.DataFrame

In [59]:
type(data1.Marks)

pandas.core.series.Series

In [67]:
data2.sort_values('class')

   class
0      1
1      2
2      3
3      4
4      5
5      6
8      7
6      8
9      8
7      9

In [65]:
data2.class.sort_values()

SyntaxError: invalid syntax (<ipython-input-65-34c5a7015747>, line 1)

In [77]:
data2.duplicated()#sum()#shows the count of duplicates #return trye if a duplicate is present

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9     True
dtype: bool

In [80]:
data2.drop_duplicates()#removes the duplicates

   class
0      1
1      2
2      3
3      4
4      5
5      6
6      8
7      9
8      7

In [83]:
data3=pd.DataFrame({'class':[1,2,3,4,5,6,8,9,7,'']})
data3

  class
0     1
1     2
2     3
3     4
4     5
5     6
6     8
7     9
8     7
9